simakvladimir/system-software/arm/lm3s315_dft/include/drivers/pin_map.h
#define ADC6_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define ADC6_PORT               (GPIO_PORTD_BASE)
#define ADC6_PIN                (GPIO_PIN_5)

#define ADC7_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define ADC7_PORT               (GPIO_PORTD_BASE)
#define ADC7_PIN                (GPIO_PIN_4)

#define C0_MINUS_PERIPH         (SYSCTL_PERIPH_GPIOB)
#define C0_MINUS_PORT           (GPIO_PORTB_BASE)
#define C0_MINUS_PIN            (GPIO_PIN_4)

#define C0_PLUS_PERIPH          (SYSCTL_PERIPH_GPIOB)
#define C0_PLUS_PORT            (GPIO_PORTB_BASE)
#define C0_PLUS_PIN             (GPIO_PIN_6)

#define C1_MINUS_PERIPH         (SYSCTL_PERIPH_GPIOB)
#define C1_MINUS_PORT           (GPIO_PORTB_BASE)
#define C1_MINUS_PIN            (GPIO_PIN_5)

#define C1_PLUS_PERIPH          (SYSCTL_PERIPH_GPIOC)
#define C1_PLUS_PORT            (GPIO_PORTC_BASE)
#define C1_PLUS_PIN             (GPIO_PIN_5)

#define CCP0_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define CCP0_PORT               (GPIO_PORTD_BASE)
#define CCP0_PIN                (GPIO_PIN_3)

#define CCP1_PERIPH             (SYSCTL_PERIPH_GPIOF)
#define CCP1_PORT               (GPIO_PORTF_BASE)
#define CCP1_PIN                (GPIO_PIN_6)

#define CCP2_PERIPH             (SYSCTL_PERIPH_GPIOF)
#define CCP2_PORT               (GPIO_PORTF_BASE)
#define CCP2_PIN                (GPIO_PIN_5)

#define CCP3_PERIPH             (SYSCTL_PERIPH_GPIOG)
#define CCP3_PORT               (GPIO_PORTG_BASE)
#define CCP3_PIN                (GPIO_PIN_4)

#define CCP4_PERIPH             (SYSCTL_PERIPH_GPIOC)
#define CCP4_PORT               (GPIO_PORTC_BASE)
#define CCP4_PIN                (GPIO_PIN_4)

#define CCP5_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define CCP5_PORT               (GPIO_PORTD_BASE)
#define CCP5_PIN                (GPIO_PIN_2)

#define CCP6_PERIPH             (SYSCTL_PERIPH_GPIOH)
#define CCP6_PORT               (GPIO_PORTH_BASE)
#define CCP6_PIN                (GPIO_PIN_0)

#define CCP7_PERIPH             (SYSCTL_PERIPH_GPIOH)
#define CCP7_PORT               (GPIO_PORTH_BASE)
#define CCP7_PIN                (GPIO_PIN_1)

#define FAULT0_PERIPH           (SYSCTL_PERIPH_GPIOF)
#define FAULT0_PORT             (GPIO_PORTF_BASE)
#define FAULT0_PIN              (GPIO_PIN_4)

#define FAULT1_PERIPH           (SYSCTL_PERIPH_GPIOG)
#define FAULT1_PORT             (GPIO_PORTG_BASE)
#define FAULT1_PIN              (GPIO_PIN_5)

#define FAULT2_PERIPH           (SYSCTL_PERIPH_GPIOG)
#define FAULT2_PORT             (GPIO_PORTG_BASE)
#define FAULT2_PIN              (GPIO_PIN_3)

#define FAULT3_PERIPH           (SYSCTL_PERIPH_GPIOH)
#define FAULT3_PORT             (GPIO_PORTH_BASE)
#define FAULT3_PIN              (GPIO_PIN_2)

#define I2C0SCL_PERIPH          (SYSCTL_PERIPH_GPIOB)
#define I2C0SCL_PORT            (GPIO_PORTB_BASE)
#define I2C0SCL_PIN             (GPIO_PIN_2)

#define I2C0SDA_PERIPH          (SYSCTL_PERIPH_GPIOB)
#define I2C0SDA_PORT            (GPIO_PORTB_BASE)
#define I2C0SDA_PIN             (GPIO_PIN_3)

#define I2C1SCL_PERIPH          (SYSCTL_PERIPH_GPIOA)
#define I2C1SCL_PORT            (GPIO_PORTA_BASE)
#define I2C1SCL_PIN             (GPIO_PIN_6)

#define I2C1SDA_PERIPH          (SYSCTL_PERIPH_GPIOA)
#define I2C1SDA_PORT            (GPIO_PORTA_BASE)
#define I2C1SDA_PIN             (GPIO_PIN_7)

#define IDX0_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define IDX0_PORT               (GPIO_PORTD_BASE)
#define IDX0_PIN                (GPIO_PIN_0)

#define NMI_PERIPH              (SYSCTL_PERIPH_GPIOB)
#define NMI_PORT                (GPIO_PORTB_BASE)
#define NMI_PIN                 (GPIO_PIN_7)

#define PHA0_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define PHA0_PORT               (GPIO_PORTD_BASE)
#define PHA0_PIN                (GPIO_PIN_1)

#define PHB0_PERIPH             (SYSCTL_PERIPH_GPIOF)
#define PHB0_PORT               (GPIO_PORTF_BASE)
#define PHB0_PIN                (GPIO_PIN_7)

#define PWM0_PERIPH             (SYSCTL_PERIPH_GPIOF)
#define PWM0_PORT               (GPIO_PORTF_BASE)
#define PWM0_PIN                (GPIO_PIN_0)

#define PWM1_PERIPH             (SYSCTL_PERIPH_GPIOF)
#define PWM1_PORT               (GPIO_PORTF_BASE)
#define PWM1_PIN                (GPIO_PIN_1)

#define PWM2_PERIPH             (SYSCTL_PERIPH_GPIOF)
#define PWM2_PORT               (GPIO_PORTF_BASE)
#define PWM2_PIN                (GPIO_PIN_2)

#define PWM3_PERIPH             (SYSCTL_PERIPH_GPIOF)
#define PWM3_PORT               (GPIO_PORTF_BASE)
#define PWM3_PIN                (GPIO_PIN_3)

#define PWM4_PERIPH             (SYSCTL_PERIPH_GPIOG)
#define PWM4_PORT               (GPIO_PORTG_BASE)
#define PWM4_PIN                (GPIO_PIN_0)

#define PWM5_PERIPH             (SYSCTL_PERIPH_GPIOG)
#define PWM5_PORT               (GPIO_PORTG_BASE)
#define PWM5_PIN                (GPIO_PIN_1)

#define PWM6_PERIPH             (SYSCTL_PERIPH_GPIOG)
#define PWM6_PORT               (GPIO_PORTG_BASE)
#define PWM6_PIN                (GPIO_PIN_6)

#define PWM7_PERIPH             (SYSCTL_PERIPH_GPIOG)
#define PWM7_PORT               (GPIO_PORTG_BASE)
#define PWM7_PIN                (GPIO_PIN_7)

#define SSI0CLK_PERIPH          (SYSCTL_PERIPH_GPIOA)
#define SSI0CLK_PORT            (GPIO_PORTA_BASE)
#define SSI0CLK_PIN             (GPIO_PIN_2)

#define SSI0FSS_PERIPH          (SYSCTL_PERIPH_GPIOA)
#define SSI0FSS_PORT            (GPIO_PORTA_BASE)
#define SSI0FSS_PIN             (GPIO_PIN_3)

#define SSI0RX_PERIPH           (SYSCTL_PERIPH_GPIOA)
#define SSI0RX_PORT             (GPIO_PORTA_BASE)
#define SSI0RX_PIN              (GPIO_PIN_4)

#define SSI0TX_PERIPH           (SYSCTL_PERIPH_GPIOA)
#define SSI0TX_PORT             (GPIO_PORTA_BASE)
#define SSI0TX_PIN              (GPIO_PIN_5)

#define SSI1CLK_PERIPH          (SYSCTL_PERIPH_GPIOE)
#define SSI1CLK_PORT            (GPIO_PORTE_BASE)
#define SSI1CLK_PIN             (GPIO_PIN_0)

#define SSI1FSS_PERIPH          (SYSCTL_PERIPH_GPIOE)
#define SSI1FSS_PORT            (GPIO_PORTE_BASE)
#define SSI1FSS_PIN             (GPIO_PIN_1)

#define SSI1RX_PERIPH           (SYSCTL_PERIPH_GPIOE)
#define SSI1RX_PORT             (GPIO_PORTE_BASE)
#define SSI1RX_PIN              (GPIO_PIN_2)

