simakvladimir/system-software/arm/lm3s315_dft/include/drivers/pin_map.h
#define I2C1SCL_PERIPH          (SYSCTL_PERIPH_GPIOG)
#define I2C1SCL_PORT            (GPIO_PORTG_BASE)
#define I2C1SCL_PIN             (GPIO_PIN_0)

#define I2C1SDA_PERIPH          (SYSCTL_PERIPH_GPIOG)
#define I2C1SDA_PORT            (GPIO_PORTG_BASE)
#define I2C1SDA_PIN             (GPIO_PIN_1)

#define IDX0_PERIPH             (SYSCTL_PERIPH_GPIOG)
#define IDX0_PORT               (GPIO_PORTG_BASE)
#define IDX0_PIN                (GPIO_PIN_5)

#define NMI_PERIPH              (SYSCTL_PERIPH_GPIOB)
#define NMI_PORT                (GPIO_PORTB_BASE)
#define NMI_PIN                 (GPIO_PIN_7)

#define PHA0_PERIPH             (SYSCTL_PERIPH_GPIOF)
#define PHA0_PORT               (GPIO_PORTF_BASE)
#define PHA0_PIN                (GPIO_PIN_6)

#define PHB0_PERIPH             (SYSCTL_PERIPH_GPIOC)
#define PHB0_PORT               (GPIO_PORTC_BASE)
#define PHB0_PIN                (GPIO_PIN_6)

#define PWM0_PERIPH             (SYSCTL_PERIPH_GPIOF)
#define PWM0_PORT               (GPIO_PORTF_BASE)
#define PWM0_PIN                (GPIO_PIN_0)

#define PWM1_PERIPH             (SYSCTL_PERIPH_GPIOF)
#define PWM1_PORT               (GPIO_PORTF_BASE)
#define PWM1_PIN                (GPIO_PIN_1)

#define PWM2_PERIPH             (SYSCTL_PERIPH_GPIOH)
#define PWM2_PORT               (GPIO_PORTH_BASE)
#define PWM2_PIN                (GPIO_PIN_0)

#define PWM3_PERIPH             (SYSCTL_PERIPH_GPIOH)
#define PWM3_PORT               (GPIO_PORTH_BASE)
#define PWM3_PIN                (GPIO_PIN_1)

#define PWM4_PERIPH             (SYSCTL_PERIPH_GPIOF)
#define PWM4_PORT               (GPIO_PORTF_BASE)
#define PWM4_PIN                (GPIO_PIN_2)

#define PWM5_PERIPH             (SYSCTL_PERIPH_GPIOF)
#define PWM5_PORT               (GPIO_PORTF_BASE)
#define PWM5_PIN                (GPIO_PIN_3)

#define PWM6_PERIPH             (SYSCTL_PERIPH_GPIOG)
#define PWM6_PORT               (GPIO_PORTG_BASE)
#define PWM6_PIN                (GPIO_PIN_6)

#define PWM7_PERIPH             (SYSCTL_PERIPH_GPIOG)
#define PWM7_PORT               (GPIO_PORTG_BASE)
#define PWM7_PIN                (GPIO_PIN_7)

#define SSI0CLK_PERIPH          (SYSCTL_PERIPH_GPIOA)
#define SSI0CLK_PORT            (GPIO_PORTA_BASE)
#define SSI0CLK_PIN             (GPIO_PIN_2)

#define SSI0FSS_PERIPH          (SYSCTL_PERIPH_GPIOA)
#define SSI0FSS_PORT            (GPIO_PORTA_BASE)
#define SSI0FSS_PIN             (GPIO_PIN_3)

#define SSI0RX_PERIPH           (SYSCTL_PERIPH_GPIOA)
#define SSI0RX_PORT             (GPIO_PORTA_BASE)
#define SSI0RX_PIN              (GPIO_PIN_4)

#define SSI0TX_PERIPH           (SYSCTL_PERIPH_GPIOA)
#define SSI0TX_PORT             (GPIO_PORTA_BASE)
#define SSI0TX_PIN              (GPIO_PIN_5)

#define SSI1CLK_PERIPH          (SYSCTL_PERIPH_GPIOE)
#define SSI1CLK_PORT            (GPIO_PORTE_BASE)
#define SSI1CLK_PIN             (GPIO_PIN_0)

#define SSI1FSS_PERIPH          (SYSCTL_PERIPH_GPIOE)
#define SSI1FSS_PORT            (GPIO_PORTE_BASE)
#define SSI1FSS_PIN             (GPIO_PIN_1)

#define SSI1RX_PERIPH           (SYSCTL_PERIPH_GPIOE)
#define SSI1RX_PORT             (GPIO_PORTE_BASE)
#define SSI1RX_PIN              (GPIO_PIN_2)

#define SSI1TX_PERIPH           (SYSCTL_PERIPH_GPIOE)
#define SSI1TX_PORT             (GPIO_PORTE_BASE)
#define SSI1TX_PIN              (GPIO_PIN_3)

#define SWCLK_PERIPH            (SYSCTL_PERIPH_GPIOC)
#define SWCLK_PORT              (GPIO_PORTC_BASE)
#define SWCLK_PIN               (GPIO_PIN_0)

#define SWDIO_PERIPH            (SYSCTL_PERIPH_GPIOC)
#define SWDIO_PORT              (GPIO_PORTC_BASE)
#define SWDIO_PIN               (GPIO_PIN_1)

#define SWO_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define SWO_PORT                (GPIO_PORTC_BASE)
#define SWO_PIN                 (GPIO_PIN_3)

#define TCK_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define TCK_PORT                (GPIO_PORTC_BASE)
#define TCK_PIN                 (GPIO_PIN_0)

#define TDI_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define TDI_PORT                (GPIO_PORTC_BASE)
#define TDI_PIN                 (GPIO_PIN_2)

#define TDO_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define TDO_PORT                (GPIO_PORTC_BASE)
#define TDO_PIN                 (GPIO_PIN_3)

#define TMS_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define TMS_PORT                (GPIO_PORTC_BASE)
#define TMS_PIN                 (GPIO_PIN_1)

#define U0RX_PERIPH             (SYSCTL_PERIPH_GPIOA)
#define U0RX_PORT               (GPIO_PORTA_BASE)
#define U0RX_PIN                (GPIO_PIN_0)

#define U0TX_PERIPH             (SYSCTL_PERIPH_GPIOA)
#define U0TX_PORT               (GPIO_PORTA_BASE)
#define U0TX_PIN                (GPIO_PIN_1)

#define U1RX_PERIPH             (SYSCTL_PERIPH_GPIOB)
#define U1RX_PORT               (GPIO_PORTB_BASE)
#define U1RX_PIN                (GPIO_PIN_0)

#define U1TX_PERIPH             (SYSCTL_PERIPH_GPIOB)
#define U1TX_PORT               (GPIO_PORTB_BASE)
#define U1TX_PIN                (GPIO_PIN_1)

#define U2RX_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define U2RX_PORT               (GPIO_PORTD_BASE)
#define U2RX_PIN                (GPIO_PIN_0)

#define U2TX_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define U2TX_PORT               (GPIO_PORTD_BASE)
#define U2TX_PIN                (GPIO_PIN_1)

#define USB0EPEN_PERIPH         (SYSCTL_PERIPH_GPIOH)
#define USB0EPEN_PORT           (GPIO_PORTH_BASE)
#define USB0EPEN_PIN            (GPIO_PIN_3)

#define USB0PFLT_PERIPH         (SYSCTL_PERIPH_GPIOH)
#define USB0PFLT_PORT           (GPIO_PORTH_BASE)
#define USB0PFLT_PIN            (GPIO_PIN_4)

#endif // PART_LM3S3749

//*****************************************************************************
//
// LM3S5632 Port/Pin Mapping Definitions
//
//*****************************************************************************
#ifdef PART_LM3S5632

#define ADC0_PERIPH             (SYSCTL_PERIPH_GPIOE)
#define ADC0_PORT               (GPIO_PORTE_BASE)
#define ADC0_PIN                (GPIO_PIN_3)

#define ADC1_PERIPH             (SYSCTL_PERIPH_GPIOE)
#define ADC1_PORT               (GPIO_PORTE_BASE)
#define ADC1_PIN                (GPIO_PIN_2)

#define ADC2_PERIPH             (SYSCTL_PERIPH_GPIOE)
#define ADC2_PORT               (GPIO_PORTE_BASE)
#define ADC2_PIN                (GPIO_PIN_1)

